{
    "uri": "8624233112",
    "lang": "eng",
    "isDuplicate": false,
    "date": "2025-04-07",
    "time": "11:05:15",
    "dateTime": "2025-04-07T11:05:15Z",
    "dateTimePub": "2025-04-07T10:10:44Z",
    "dataType": "news",
    "sim": 0,
    "url": "https://finance.yahoo.com/news/markets-tumble-three-day-selloff-101044927.html",
    "title": "Markets Tumble as Three-Day Selloff Wipes Out $9.5 Trillion",
    "body": "(Bloomberg) -- The carnage in financial markets worsened on Monday with stressed-out investors abandoning hopes that President Donald Trump would change his tariff policy.\n\nMost Read from Bloomberg\n\nStocks tumbled, taking the three-day wipeout in global equity value to about $9.5 trillion. S&P 500 equity futures signaled a 3% loss and the VIX Index spiked above 50. Europe's Stoxx 600 tumbled 5%. Asia capped the worst day since 2008. Treasuries and the yen gained as investors sought refuge.\n\nTraders boosted their expectations for Federal Reserve interest rate cuts this year, pricing in the equivalent to five quarter-point moves. Swaps also showed the risk of an emergency move, reflecting a 40% chance of a cut by next week, well before the Fed's meeting in May.\n\nTrump's determination over the weekend to go ahead with tariffs despite recession warnings from prominent economists and criticism from hedge fund managers, like supporter Bill Ackman, added to a sense that there's little chance of the president rolling back his strategy. Trump told reporters on Air Force One on Sunday to \"forget markets for a second\" in a flash of disregard for the selloff engulfing Wall Street.\n\n\"It starts to feel as if the market is getting into a \\\"sell now, ask questions later\\\" kind of mood,\" said Stephan Kemper, chief investment strategist at BNP Paribas Wealth Management. \"The market is looking for the point of max pain at which the Trump administration and/or the Fed start to blink.\"\n\nSubscribe to the Bloomberg Daybreak podcast on Apple, Spotify or anywhere you listen.\n\nMarkets around the world buckled from the selloff. Tesla Inc. shares plunged as much as 10% after Daniel Ives, a Wedbush Securities analyst and long-time bull, slashed his price target. Apple Inc., Amazon.com Inc. and Citigroup Inc. dropped about 5%.\n\nEurope's Stoxx 600 Index plunged to the lowest since December 2023 and Germany's DAX Index briefly sank 10% before recovering. Defense companies, some of the best-performing stocks this year, were among the hit hardest as investors built cash by selling winners.\n\nIn Asia, the Hang Seng Index sank 13% and South Korea also briefly halted sell orders for program trading. China's policymakers discussed measures over the weekend to stabilize the economy and the markets, including whether to accelerate plans to unleash stimulus to bolster consumption, according to people familiar with the matter.",
    "source": {
        "uri": "finance.yahoo.com",
        "dataType": "news",
        "title": "Yahoo! Finance"
    },
    "authors": [],
    "image": "https://s.yimg.com/ny/api/res/1.2/U3M5J7qR_i4u2yjeasl9IQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/bloomberg_holding_pen_162/af89dbcf2ee11342b6f3eba4ff3bf320",
    "sentiment": 0.003921568627450966,
    "wgt": 481719915,
    "relevance": 1
}